Repository: 84000/data-translation-memory
Catalog: toh218-v1.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་གང་ལགས་པ་དེ་ལ་བདག་གིས་ཀྱང་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བར་འཚལ་ལོ། །
en: I, too, shall guard, protect, and shield those who comprehend, hold, read, and perfectly master this Dharma discourse.”

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་སྟོན་ཅིག །
en: “Ānanda, comprehend this Dharma discourse, establish it, assemble it, perfectly master it, and teach it widely to others.

source: ཀུན་དགའ་བོ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མེ་ལོང་ཡིན་པའི་ཕྱིར་རོ།
en: Because, Ānanda, it is the Dharma mirror of all phenomena.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་གིས་གཟུང་ལགས་ན།
en: “Bhagavān, just as the Tathāgata commands, I shall comprehend this Dharma discourse.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: Bhagavān, what is the name of this Dharma discourse?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How shall it be retained?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “Ānanda, for all these reasons, retain this Dharma discourse with the name ‘Purification of Karmic Obscurations.’

source: སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ལ་འཇུག་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: Also retain it with the name ‘Entering the Unobscured Exalted Wisdom.’ ”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་དགེ་སློང་དྲུག་ཅུས་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: When this Dharma discourse was expounded, the minds of sixty monks were liberated from all defilements, without remainder.

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཅུས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Eighty bodhisattvas attained patient forbearance in seeing all phenomena as nonarising.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། །
en: When the Bhagavān had thus spoken, Youthful Mañjuśrī, the venerable Ānanda,

source: དགེ་སློང་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །
en: the monks, and the worlds of gods, humans, demigods, and gandharvas rejoiced and highly praised the Bhagavān’s words.

source: འཕགས་པ་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །
en: This concludes the noble Mahāyāna sūtra, “ Purification of Karmic Obscurations

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲཛྙཱ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །
en: The sūtra was translated and edited by the Indian preceptors Jinamitra and Prajñāvarman and by the principal editor-translator Bandé Yeshé Dé, along with others.
